{
  "id": "38444cdb-a011-4bbb-b315-7f1b0d9926b6",
  "siteName": "OppSphere",
  "domainUrl": "oppsphere.com",
  "brandingPresets": [
    {
      "presetId": "00000000-af5e-4330-86f0-53adbcd2adc9",
      "brandIdentity": {
        "designSummary": "**The Opportunity Canvas: Minimalist Clarity with Strategic Accents**\n\nThe OppSphere brand identity is built upon the principle of 'Minimalist Clarity,' drawing inspiration from the disciplined elegance of Japanese Zen gardens and the functional purity of Dieter Rams' design philosophy. Our approach is to create a transparent, highly functional digital space that serves as a perfect canvas for the diverse opportunities we present. The design will be characterized by an extreme, disciplined use of negative space, a strict adherence to a multi-column grid for perfect alignment, and a refined typographic hierarchy. While the core aesthetic is clean and monochromatic, strategic use of a sophisticated blue and soft purple palette will introduce a modern, trustworthy, and premium feel, guiding the user's eye to critical actions and information without overwhelming the minimalist foundation. Animations will be subtle and functional, enhancing the user experience rather than distracting from it. This synthesis ensures OppSphere feels both cutting-edge and profoundly accessible.\n\n**Execution Blueprint:**\n1. **The Grid as Foundation:** A strict 12-column grid will govern all layouts, ensuring perfect alignment and balance. Content will be structured within this grid, with generous padding to maximize negative space.\n2. **Typography as the Primary Voice:** A single, highly legible Sans-Serif font will be used. Hierarchy will be achieved through precise variations in size, weight, and case, ensuring readability and a premium feel.\n3. **Color Restraint:** A base of white and light grey will dominate. A primary blue and a secondary soft purple will be used sparingly for CTAs, links, and key interactive elements, reinforcing trust and modernity.\n4. **Whitespace as a Design Element:** Generous use of negative space will define sections and create visual breathing room, making content easily digestible and highlighting the 'premium' aspect.\n5. **Functional Animation:** Animations will be subtle, focusing on smooth transitions for state changes (e.g., hover effects, modal openings) and gentle reveals, enhancing usability without compromising the minimalist aesthetic.\n6. **Iconography for Clarity:** Simple, line-based icons will be used for categories and key features, providing immediate visual cues without adding decorative clutter.",
        "toneOfVoice": "Empowering, Trustworthy, Clear, Professional, Accessible",
        "tones": [
          "Empowering",
          "Trustworthy",
          "Clear",
          "Professional",
          "Accessible",
          "Modern",
          "Premium"
        ],
        "designStyle": {
          "primaryStyle": [
            "Minimalist",
            "Modern",
            "Clean"
          ],
          "supportingStyles": [
            "Premium",
            "Tech-focused",
            "Trustworthy"
          ]
        },
        "palette": {
          "colors": {
            "primary": "#007AFF",
            "primaryForeground": "#FFFFFF",
            "secondary": "#8A2BE2",
            "secondaryForeground": "#FFFFFF",
            "background": "#F8F9FA",
            "foreground": "#333333",
            "customColors": [
              {
                "name": "accentBlue",
                "value": "#007AFF"
              },
              {
                "name": "accentPurple",
                "value": "#8A2BE2"
              },
              {
                "name": "neutralGrey",
                "value": "#CCCCCC"
              },
              {
                "name": "darkGrey",
                "value": "#333333"
              },
              {
                "name": "offWhite",
                "value": "#F8F9FA"
              }
            ]
          },
          "paletteUsageGuide": "The primary palette consists of a clean off-white background (#F8F9FA) and dark grey foreground (#333333) for maximum readability. The primary accent color is a vibrant blue (#007AFF), used for primary calls-to-action, links, and interactive elements. A secondary soft purple (#8A2BE2) is used for supporting elements or to create visual distinction in specific sections. Neutral grey (#CCCCCC) can be used for borders, dividers, or secondary text. Ensure high contrast for all text elements against their backgrounds.",
          "paletteAccessibilityNotes": "All color combinations must meet WCAG AA contrast ratios. The primary blue and secondary purple are chosen for their accessibility against white and off-white backgrounds. Text on colored backgrounds must also meet contrast requirements. Avoid using purple for critical information if it significantly reduces contrast with the background or primary text."
        },
        "typography": {
          "headings": {
            "font": {
              "role": "headings",
              "fontFamily": "rubik-v2",
              "fontJustification": ""
            },
            "headingsSimilarFonts": [],
            "headingsUsageGuide": "Headings should be bold and use a clear hierarchy. Use 'rubik-v2' for all headings. Employ variations in font size and weight (e.g., Bold for H1/H2, Medium for H3/H4) to establish a clear visual hierarchy. Ensure ample line height for readability.",
            "headingsAccessibilityNotes": "Ensure sufficient contrast between heading text and background. Avoid excessively small font sizes for headings, especially on mobile. Maintain consistent weight and size for similar heading levels."
          },
          "paragraphs": {
            "font": {
              "role": "paragraphs",
              "fontFamily": "open sans",
              "fontJustification": ""
            },
            "paragraphsSimilarFonts": [],
            "paragraphsUsageGuide": "Body text should be highly readable, using 'open sans' in a regular or medium weight. Maintain a comfortable line height and adequate letter spacing for extended reading. Ensure text is not too narrow or too wide.",
            "paragraphsAccessibilityNotes": "Paragraph text must have a minimum font size of 16px (or equivalent rem) for desktop and 14px for mobile. Maintain a minimum contrast ratio of 4.5:1 for body text against its background. Avoid justified text, which can create uneven spacing and readability issues."
          },
          "welcomeSectionTypography": {
            "placement": "Centered within the hero section, or left-aligned with ample space.",
            "implementation": "Headline: Use 'rubik-v2' Bold, large size (e.g., 5xl-7xl). Tagline: Use 'open sans' Regular or Medium, smaller size (e.g., xl-2xl), potentially with slightly increased letter spacing for elegance."
          },
          "fontSizes": [
            {
              "name": "xs",
              "size": "0.75rem",
              "lineHeight": "1.25",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "sm",
              "size": "0.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "base",
              "size": "1rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.01em",
              "fontWeight": "400"
            },
            {
              "name": "lg",
              "size": "1.125rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.01em",
              "fontWeight": "500"
            },
            {
              "name": "xl",
              "size": "1.25rem",
              "lineHeight": "1.4",
              "letterSpacing": "0.01em",
              "fontWeight": "600"
            },
            {
              "name": "2xl",
              "size": "1.5rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.01em",
              "fontWeight": "600"
            },
            {
              "name": "3xl",
              "size": "1.875rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.005em",
              "fontWeight": "700"
            },
            {
              "name": "4xl",
              "size": "2.25rem",
              "lineHeight": "1.15",
              "letterSpacing": "0.005em",
              "fontWeight": "700"
            },
            {
              "name": "5xl",
              "size": "3rem",
              "lineHeight": "1.1",
              "letterSpacing": "0.002em",
              "fontWeight": "700"
            },
            {
              "name": "6xl",
              "size": "3.75rem",
              "lineHeight": "1.05",
              "letterSpacing": "0.001em",
              "fontWeight": "700"
            },
            {
              "name": "7xl",
              "size": "4.5rem",
              "lineHeight": "1.02",
              "letterSpacing": "0",
              "fontWeight": "700"
            },
            {
              "name": "8xl",
              "size": "6rem",
              "lineHeight": "1",
              "letterSpacing": "0",
              "fontWeight": "700"
            },
            {
              "name": "9xl",
              "size": "8rem",
              "lineHeight": "1",
              "letterSpacing": "0",
              "fontWeight": "700"
            }
          ]
        },
        "layout": {
          "layoutDna": {
            "densitySpectrum": "Spacious and airy, with significant negative space defining content blocks.",
            "contrastSpectrum": "High contrast between text and background, with accent colors used strategically for emphasis.",
            "gridAlignmentSpectrum": "Strict adherence to a 12-column grid for perfect alignment and balance.",
            "negativeSpaceUsage": "Extensive and disciplined use of whitespace to create clarity, focus, and a premium feel.",
            "textVsImageEmphasis": "Balanced, with clear typography as the primary information carrier, supported by clean imagery and icons.",
            "complexitySpectrum": "Minimalist and functional, avoiding decorative elements or visual clutter."
          },
          "grid": {
            "compositionApproach": "Strict 12-column grid with full-bleed sections and generous internal padding.",
            "spacing": {
              "columns": "12 columns",
              "rows": "Flexible, determined by content and section height",
              "gaps": "Base unit: 8px. All grid gaps and internal spacing are multiples of 8px (e.g., 16px, 24px, 32px)."
            },
            "margins": "Generous margins around content blocks and sections to enhance negative space.",
            "padding": "Consistent internal padding within containers and grid cells, typically 24px or 32px."
          },
          "heroSectionLayout": "**The Clarity Canvas**\nComposition (Tailwind Spec): `relative h-screen w-full flex items-center justify-center overflow-hidden`.\nSignature Hook (Framer Motion Spec): `motion.div` with `initial={{ opacity: 0 }}` and `animate={{ opacity: 1 }}` with `transition={{ duration: 1.5 }}`. Headline `motion.h1` uses `variants` with `transition: { staggerChildren: 0.05 }`. Each letter `span` has `initial={{ opacity: 0, y: 20 }}` and `animate={{ opacity: 1, y: 0 }}`. Tagline `motion.p` fades in after headline."
        },
        "components": {
          "containers": "Method: Whitespace, Style: 80px vertical margin between sections. Internal containers use 24px-32px padding. No borders or shadows unless for specific interactive states.",
          "images": "Layout Role: Integrated cleanly within the grid, often full-width within a section or as a prominent element in a card. | Gallery Type: Clean Card-Based Grid: A uniform grid of cards, each containing an image, title, and brief description. Images are consistently sized within their cards.",
          "buttons": "Primary: background-color: #007AFF, color: #FFFFFF, border-radius: 8px, padding: 12px 24px, font-weight: 600. Secondary: background-color: transparent, color: #007AFF, border: 1px solid #007AFF, border-radius: 8px, padding: 12px 24px, font-weight: 600. Hover states should subtly change background opacity or add a slight scale effect."
        },
        "graphicElements": {
          "icons": "Style: Clean, line-based icons with a consistent stroke weight. Use accent blue or dark grey. Ensure they are scalable and maintain clarity at various sizes.",
          "illustrations": "Style: Minimalist, flat illustrations using the brand palette (blue, purple, white, grey). Focus on conveying concepts rather than decorative detail.",
          "stickers": ""
        }
      },
      "originImagesUrls": []
    },
    {
      "presetId": "b79b22a6-ece2-442e-b139-cbc39266ccad",
      "brandIdentity": {
        "designSummary": "This brand design features a bold and modern aesthetic centered around a vibrant green background color that dominates the header and key sections, paired with high-contrast black typography and clean white content backgrounds. The typography is a key visual element, with an oversized, uppercase sans-serif font used for the main brand name, conveying strength and professionalism. Navigation and body text use a smaller, clean sans-serif font in black for clarity and simplicity. The layout is spacious and balanced, employing generous white space and a two-column grid for project showcases. UI components are minimalistic, with subtle rounded corners on text overlays adding softness to the otherwise sharp design. The overall style is minimalistic and modern, emphasizing clarity, confidence, and a professional tone suitable for creative or architectural firms.",
        "toneOfVoice": "Confident, professional, modern, and authoritative with a fresh and approachable edge.",
        "tones": [
          "bold",
          "clean",
          "modern",
          "professional",
          "minimal",
          "confident",
          "fresh",
          "authoritative",
          "trustworthy",
          "balanced"
        ],
        "designStyle": {
          "primaryStyle": [
            "Minimalism",
            "Modernism"
          ],
          "supportingStyles": [
            "Bold Typography",
            "Grid-Based Layout"
          ]
        },
        "palette": {
          "colors": {
            "primary": "#00965E",
            "primaryForeground": "#000000",
            "secondary": "#FFFFFF",
            "secondaryForeground": "#000000",
            "background": "#FFFFFF",
            "customColors": [
              {
                "name": "foreground",
                "value": "#000000"
              },
              {
                "name": "destructive",
                "value": "#DF3131"
              },
              {
                "name": "destructiveforeground",
                "value": "#FFFFFF"
              },
              {
                "name": "subtletext",
                "value": "#333333"
              }
            ]
          },
          "paletteUsageGuide": "The color system relies on high contrast and bold blocking. The 'primary' color is the signature of the brand; use it for the main navigation header background, key accent elements, or large structural blocks. Crucially, text placed on the 'primary' color must always be the 'primaryForeground' color (black) to maintain the brand's industrial aesthetic and accessibility standards; do not use white text on the 'primary' background. The 'background' color serves as the main canvas for content. Use the 'secondary' color (white) specifically for overlay cards, content containers, or distinct sections that sit on top of images or darker backgrounds. Text on these white areas should always be the 'secondaryForeground' color. The 'foreground' color is used for all main body text and headings on the standard background.",
          "paletteAccessibilityNotes": "The combination of the 'primary' background (vibrant green) and 'primaryForeground' (black) creates a high-contrast ratio that comfortably meets WCAG AAA standards. Avoid using white text on the 'primary' background, as it will likely fail contrast requirements. The 'background' and 'secondary' colors (white) paired with 'foreground' or 'secondaryForeground' (black) provide maximum legibility (21:1 ratio)."
        },
        "typography": {
          "headings": {
            "font": {
              "role": "Primary Heading Font",
              "fontFamily": "helvetica-w01-bold",
              "fontJustification": ""
            },
            "headingsSimilarFonts": [
              "oswald",
              "montserrat-black-new",
              "titillium-black"
            ],
            "headingsUsageGuide": "Use the heading font for all major titles and brand names, especially in uppercase to emphasize boldness and clarity. Pair with the paragraph font to create a clear typographic hierarchy. Maintain generous spacing around headings to enhance readability and impact. Avoid using the heading font for body text to preserve legibility.",
            "headingsAccessibilityNotes": "Headings using the 'primaryForeground' color on the 'primary' or 'secondary' backgrounds meet WCAG AA contrast requirements, ensuring clear visibility and accessibility."
          },
          "paragraphs": {
            "font": {
              "role": "Body Text Font",
              "fontFamily": "helvetica-w01-light",
              "fontJustification": ""
            },
            "paragraphsSimilarFonts": [
              "nunito sans",
              "raleway",
              "work-sans-v2"
            ],
            "paragraphsUsageGuide": "Use the paragraph font for all body text, navigation links, and smaller informational text. Maintain consistent line height and spacing for readability. Combine with the heading font to create a balanced typographic system. Use 'primaryForeground' or 'secondaryForeground' colors depending on background for optimal contrast.",
            "paragraphsAccessibilityNotes": "Body text colors on their respective backgrounds meet WCAG AA standards for legibility, supporting accessible reading experiences."
          },
          "welcomeSectionTypography": {
            "placement": "Top-Third Anchor",
            "implementation": "The welcome section places the brand name and introductory text anchored in the top third of the viewport, with the brand name aligned left and navigation aligned right on a solid 'primary' background. This placement creates immediate brand recognition and a strong visual hierarchy. The large heading font dominates the space, while the smaller body text is contained in a white rounded rectangle overlay on the hero image, providing contrast and focus. This approach balances bold typography with spacious layout and clear content separation."
          },
          "fontSizes": [
            {
              "name": "xs",
              "size": "0.75rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "sm",
              "size": "0.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "base",
              "size": "1rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "400"
            },
            {
              "name": "lg",
              "size": "1.125rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "400"
            },
            {
              "name": "xl",
              "size": "1.25rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.03em",
              "fontWeight": "400"
            },
            {
              "name": "2xl",
              "size": "1.5rem",
              "lineHeight": "1.4",
              "letterSpacing": "0.03em",
              "fontWeight": "700"
            },
            {
              "name": "3xl",
              "size": "1.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.04em",
              "fontWeight": "700"
            },
            {
              "name": "4xl",
              "size": "2.25rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.04em",
              "fontWeight": "700"
            },
            {
              "name": "5xl",
              "size": "3rem",
              "lineHeight": "1.1",
              "letterSpacing": "0.05em",
              "fontWeight": "700"
            },
            {
              "name": "6xl",
              "size": "3.75rem",
              "lineHeight": "1.1",
              "letterSpacing": "0.05em",
              "fontWeight": "700"
            },
            {
              "name": "7xl",
              "size": "4.5rem",
              "lineHeight": "1",
              "letterSpacing": "0.06em",
              "fontWeight": "700"
            },
            {
              "name": "8xl",
              "size": "6rem",
              "lineHeight": "1",
              "letterSpacing": "0.06em",
              "fontWeight": "700"
            },
            {
              "name": "9xl",
              "size": "8rem",
              "lineHeight": "1",
              "letterSpacing": "0.07em",
              "fontWeight": "700"
            }
          ]
        },
        "layout": {
          "layoutDna": {
            "densitySpectrum": "Balanced",
            "contrastSpectrum": "High-Contrast",
            "gridAlignmentSpectrum": "Strict Grid",
            "negativeSpaceUsage": "Generous",
            "textVsImageEmphasis": "Balanced",
            "complexitySpectrum": "Simple & Clean"
          },
          "grid": {
            "compositionApproach": "Column-based",
            "spacing": {
              "columns": "12-column grid",
              "rows": "Defined content rows",
              "gaps": "Consistent medium gaps"
            },
            "margins": "Generous page margins",
            "padding": "Consistent padding within containers"
          }
        },
        "components": {
          "containers": "Containers use solid 'secondary' backgrounds with generous padding and rounded corners for text overlays, creating clear separation from images and backgrounds. The use of white backgrounds for content blocks ensures readability and focus.",
          "images": "Images are large, high-quality, and full-width or half-width depending on context, with no visible borders or shadows, emphasizing natural presentation and visual impact.",
          "buttons": "Buttons are minimal or text-based with underlined links in 'primaryForeground' color on 'primary' backgrounds, maintaining simplicity and clarity. Interactive states use subtle underline or color changes."
        },
        "graphicElements": {
          "icons": "No visible icons are present, maintaining a clean and minimal interface focused on typography and imagery.",
          "illustrations": "No illustrations are used, reinforcing the professional and photographic focus of the design.",
          "stickers": "No stickers or badges are present, keeping the design uncluttered and straightforward."
        }
      },
      "originImagesUrls": [
        "https://wixmp-fe53c9ff592a4da924211f23.wixmp.com/uploads/1752414053570-Frame%201707483548.jpg"
      ]
    },
    {
      "presetId": "783c8528-00c9-4951-9e63-691f5e8b8a06",
      "brandIdentity": {
        "designSummary": "This brand design embodies a refined, artisanal aesthetic with a minimalistic and elegant visual style. The layout is spacious and balanced, utilizing generous white space and a clear column-based grid system to create a clean and modular structure. The color palette centers on warm, earthy tones including a deep brown as the primary color, a soft cream/off-white background, and a muted pale yellow as a secondary background accent. Typography features a classic serif font for headings, conveying sophistication and timeless craftsmanship, paired with a clean, modern sans-serif for body text to ensure readability and neutrality. UI components such as buttons and icons are understated, using the primary brown color for subtle emphasis without heavy decoration. The overall composition emphasizes natural materials and authenticity, with large, warm-toned images complementing the textual content. This design style is versatile and suitable for brands that want to communicate quality, warmth, and artisanal values in a minimal yet elegant manner.",
        "toneOfVoice": "Sophisticated, warm, artisanal, timeless, and refined.",
        "tones": [
          "elegant",
          "warm",
          "minimalistic",
          "authentic",
          "refined",
          "calm",
          "natural",
          "balanced",
          "inviting",
          "classic"
        ],
        "designStyle": {
          "primaryStyle": [
            "Minimalism",
            "Artisanal",
            "Classic Elegance"
          ],
          "supportingStyles": [
            "Modern",
            "Editorial",
            "Natural"
          ]
        },
        "palette": {
          "colors": {
            "primary": "#4A2F1B",
            "primaryForeground": "#FFFBF0",
            "secondary": "#F0F0D8",
            "secondaryForeground": "#4A2F1B",
            "background": "#FFFBF0",
            "customColors": [
              {
                "name": "foreground",
                "value": "#4A2F1B"
              },
              {
                "name": "destructive",
                "value": "#DF3131"
              },
              {
                "name": "destructiveforeground",
                "value": "#FFFFFF"
              }
            ]
          },
          "paletteUsageGuide": "Use the 'primary' color predominantly for text, icons, and key UI elements such as navigation links and footer backgrounds to establish a grounded and sophisticated tone. The 'background' color serves as the main canvas, providing a clean and spacious feel that enhances readability and highlights content. The 'secondary' color is best applied to large background blocks or sections to introduce warmth and subtle contrast without overpowering the design. Text or UI elements placed on the 'secondary' background should use the 'secondaryForeground' color to maintain legibility and visual harmony. Avoid introducing bright or saturated colors to preserve the natural and artisanal feel. The palette supports high contrast combinations between 'primary' and 'background' for accessibility, while the 'secondary' color adds depth and softness to the overall visual hierarchy. This restrained color system ensures a timeless and elegant brand presence.",
          "paletteAccessibilityNotes": "The combination of 'primary' (#4A2F1B) text on 'background' (#FFFBF0) meets WCAG AA and AAA contrast standards for all text sizes, ensuring excellent readability. Similarly, 'secondaryForeground' on 'secondary' (#F0F0D8) also meets WCAG AA contrast requirements for body text and larger headings. The palette's high contrast between dark and light tones supports accessibility across UI components and content areas."
        },
        "typography": {
          "headings": {
            "font": {
              "role": "Primary Heading Font",
              "fontFamily": "fraunces",
              "fontJustification": ""
            },
            "headingsSimilarFonts": [
              "playfair display",
              "cormorantgaramond",
              "bitter"
            ],
            "headingsUsageGuide": "Use the heading font for all primary titles, quotes, and large textual elements to convey refinement and craftsmanship. Pair with the paragraph font to create a clear typographic hierarchy, ensuring headings stand out with ample spacing and size differentiation. Maintain consistent line heights and letter spacing to preserve readability and elegance. Avoid using the heading font for body text to prevent visual fatigue. When placed on 'background' or 'secondary' colors, use the 'primary' or 'secondaryForeground' colors respectively to ensure contrast and legibility.",
            "headingsAccessibilityNotes": "Headings set in 'fraunces' with 'primary' color on 'background' meet WCAG AA and AAA contrast standards, supporting accessibility for all users."
          },
          "paragraphs": {
            "font": {
              "role": "Main Body Text Font",
              "fontFamily": "open sans",
              "fontJustification": ""
            },
            "paragraphsSimilarFonts": [
              "work-sans-v2",
              "nunito sans",
              "raleway"
            ],
            "paragraphsUsageGuide": "Use the paragraph font for all body text, navigation links, and smaller informational content. It complements the serif headings by providing clarity and neutrality. Maintain comfortable line heights and letter spacing to enhance readability, especially in longer text blocks. Use 'primary' color for text on 'background' and 'secondaryForeground' for text on 'secondary' backgrounds. Ensure sufficient contrast and avoid overly small font sizes to maintain accessibility.",
            "paragraphsAccessibilityNotes": "Body text in 'open sans' with 'primary' color on 'background' meets WCAG AA contrast requirements for normal and large text, ensuring legibility."
          },
          "welcomeSectionTypography": {
            "placement": "Top-Third Anchor",
            "implementation": "The welcome section typography is anchored in the top third of the viewport, creating an immediate focal point upon page load. Large, elegant serif headings dominate this area, paired with smaller sans-serif subheadings or calls to action. This placement leverages generous white space around the text, enhancing its prominence and readability. The text aligns left, maintaining a classic editorial feel, and is balanced by large imagery or negative space on the right or below. This approach establishes a refined and inviting introduction to the brand."
          },
          "fontSizes": [
            {
              "name": "xs",
              "size": "0.75rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "sm",
              "size": "0.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "base",
              "size": "1rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "400"
            },
            {
              "name": "lg",
              "size": "1.125rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "400"
            },
            {
              "name": "xl",
              "size": "1.25rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "600"
            },
            {
              "name": "2xl",
              "size": "1.5rem",
              "lineHeight": "1.4",
              "letterSpacing": "0.02em",
              "fontWeight": "600"
            },
            {
              "name": "3xl",
              "size": "1.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.015em",
              "fontWeight": "700"
            },
            {
              "name": "4xl",
              "size": "2.25rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.01em",
              "fontWeight": "700"
            },
            {
              "name": "5xl",
              "size": "3rem",
              "lineHeight": "1.1",
              "letterSpacing": "0em",
              "fontWeight": "700"
            },
            {
              "name": "6xl",
              "size": "3.75rem",
              "lineHeight": "1.1",
              "letterSpacing": "-0.01em",
              "fontWeight": "700"
            },
            {
              "name": "7xl",
              "size": "4.5rem",
              "lineHeight": "1.05",
              "letterSpacing": "-0.015em",
              "fontWeight": "700"
            },
            {
              "name": "8xl",
              "size": "6rem",
              "lineHeight": "1.05",
              "letterSpacing": "-0.02em",
              "fontWeight": "700"
            },
            {
              "name": "9xl",
              "size": "8rem",
              "lineHeight": "1",
              "letterSpacing": "-0.025em",
              "fontWeight": "700"
            }
          ]
        },
        "layout": {
          "layoutDna": {
            "densitySpectrum": "Spacious",
            "contrastSpectrum": "High-Contrast",
            "gridAlignmentSpectrum": "Strict Grid",
            "negativeSpaceUsage": "Generous",
            "textVsImageEmphasis": "Balanced",
            "complexitySpectrum": "Simple & Clean"
          },
          "grid": {
            "compositionApproach": "Column-based",
            "spacing": {
              "columns": "12-column grid",
              "rows": "Defined content rows",
              "gaps": "Consistent medium gaps"
            },
            "margins": "Generous page margins",
            "padding": "Consistent padding within containers"
          }
        },
        "components": {
          "containers": "Containers are minimalistic with no heavy borders or shadows, relying on spacing and background color shifts such as 'secondary' to delineate sections. They maintain consistent padding to ensure content breathes and aligns with the grid system. The use of 'background' and 'secondary' colors helps visually separate content areas without clutter.",
          "images": "Images are large, natural, and warm-toned, integrated seamlessly with text blocks. They serve as focal points but do not introduce additional colors to the palette. Images have clean edges with no heavy frames or overlays, supporting the minimal and elegant aesthetic.",
          "buttons": "Buttons are understated with text or border in the 'primary' color. They have no heavy shadows or gradients, maintaining a flat and clean look. Primary buttons use solid 'primary' backgrounds with 'primaryForeground' text for emphasis, while secondary buttons use transparent backgrounds with 'primary' borders and text."
        },
        "graphicElements": {
          "icons": "Icons are simple line-based, using the 'primary' color to maintain consistency and subtlety. They are minimal and functional, supporting navigation and user interaction without drawing excessive attention.",
          "illustrations": "No illustrations are present, maintaining a clean and photographic-driven design language.",
          "stickers": "No stickers or badges are used, preserving the minimal and elegant brand presentation."
        }
      },
      "originImagesUrls": [
        "https://wixmp-fe53c9ff592a4da924211f23.wixmp.com/uploads/1752411921411-Group%201000002186.jpg"
      ]
    },
    {
      "presetId": "cd43b705-1687-4c07-b882-49710556fcf8",
      "brandIdentity": {
        "designSummary": "This brand design features a bold, modern aesthetic with a strong emphasis on large, impactful typography and vibrant color blocking. The layout uses a grid-based but asymmetrical composition, integrating large rectangular image blocks alongside color-filled sections to create a dynamic visual flow. The color palette is anchored by a bright lime green and a warm burnt orange, contrasted sharply with deep black and clean white backgrounds. Typography is geometric sans-serif, with heavy, large headings paired with smaller, clean body text, establishing a clear hierarchy and contemporary feel. UI elements are minimalistic, with subtle accent dots and understated navigation, reinforcing the professional yet approachable tone. Generous white space and high contrast ensure clarity and accessibility, making the design versatile for various industries seeking a confident and energetic brand presence.",
        "toneOfVoice": "Confident, modern, approachable, and energetic with a professional edge.",
        "tones": [
          "bold",
          "clean",
          "modern",
          "energetic",
          "professional",
          "approachable",
          "minimalistic",
          "dynamic",
          "accessible",
          "vibrant"
        ],
        "designStyle": {
          "primaryStyle": [
            "Minimalism",
            "Modernism"
          ],
          "supportingStyles": [
            "Bold Typography",
            "Color Blocking",
            "Grid-Based Layout"
          ]
        },
        "palette": {
          "colors": {
            "primary": "#000000",
            "primaryForeground": "#FFFFFF",
            "secondary": "#D4FF5E",
            "secondaryForeground": "#000000",
            "background": "#FFFFFF",
            "customColors": [
              {
                "name": "brandaccent",
                "value": "#BA5A1D"
              },
              {
                "name": "subtledivider",
                "value": "#E5E5E5"
              },
              {
                "name": "foreground",
                "value": "#000000"
              },
              {
                "name": "destructive",
                "value": "#DF3131"
              },
              {
                "name": "destructiveforeground",
                "value": "#FFFFFF"
              }
            ]
          },
          "paletteUsageGuide": "The color system relies on the high contrast between the `'background'` and the `'primary'` color (used for most text and structural elements). The `'brandAccent'` is the functional highlight color; use it for primary headlines, text links, and active states to draw the eye to key information. The `'secondary'` color (electric lime) is a decorative accent; use it for graphical flourishes like borders, sticker backgrounds, or icon backdrops. Do NOT use the `'secondary'` color for text on the `'background'`, as it lacks contrast. Instead, use `'secondaryForeground'` for any text placed on top of `'secondary'` elements. The `'subtleDivider'` is used for horizontal rules that separate content sections without adding visual weight.",
          "paletteAccessibilityNotes": "The combination of `'primary'` (black) and `'background'` (white) provides excellent AAA contrast. The `'brandAccent'` (rust orange) on `'background'` meets WCAG AA standards for normal text and AAA for large text, making it safe for headlines and links. The `'secondary'` color (lime green) does NOT meet contrast standards against `'background'` and must be restricted to non-text graphical elements or backgrounds. Text placed on top of the `'secondary'` color must use `'secondaryForeground'` (black) to ensure high readability."
        },
        "typography": {
          "headings": {
            "font": {
              "role": "Primary Heading Font",
              "fontFamily": "montserrat",
              "fontJustification": ""
            },
            "headingsSimilarFonts": [
              "poppins-v2",
              "raleway",
              "league spartan"
            ],
            "headingsUsageGuide": "Use the heading font in large sizes with heavy weight to create impactful titles and section headers. Pair with smaller, lighter paragraph fonts to establish clear hierarchy. Maintain ample spacing around headings to enhance readability and visual impact. Use 'primaryForeground' or 'deepBlack' for heading text to ensure strong contrast against backgrounds. Avoid using the heading font for body text to preserve clarity.",
            "headingsAccessibilityNotes": "Headings in 'primaryForeground' or 'deepBlack' on 'background' white meet WCAG AA contrast standards, ensuring readability for users with visual impairments."
          },
          "paragraphs": {
            "font": {
              "role": "Main Body Text Font",
              "fontFamily": "madefor-display",
              "fontJustification": ""
            },
            "paragraphsSimilarFonts": [
              "nunito sans",
              "work-sans-v2",
              "rubik-v2"
            ],
            "paragraphsUsageGuide": "Use the paragraph font for all body text, descriptions, and smaller informational content. Maintain a lighter weight and smaller size than headings to support hierarchy. Text color should be 'deepBlack' or 'primaryForeground' on 'background' white for optimal readability. Ensure sufficient line height and letter spacing to enhance legibility, especially on longer text blocks.",
            "paragraphsAccessibilityNotes": "Paragraph text in 'deepBlack' or 'primaryForeground' on 'background' white meets WCAG AA contrast requirements, supporting accessibility for diverse users."
          },
          "welcomeSectionTypography": {
            "placement": "Top-Third Anchor",
            "implementation": "The welcome section uses a top-third anchor placement where large, bold headings occupy the upper third of the viewport, creating immediate visual impact. This is paired with smaller body text beneath, aligned left for easy reading. The typography is supported by generous white space and minimal distractions, focusing user attention on the message. The placement balances the visual weight of the heading with the content below, establishing a clear entry point for users."
          },
          "fontSizes": [
            {
              "name": "xs",
              "size": "0.75rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "sm",
              "size": "0.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "base",
              "size": "1rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "400"
            },
            {
              "name": "lg",
              "size": "1.125rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "600"
            },
            {
              "name": "xl",
              "size": "1.5rem",
              "lineHeight": "1.4",
              "letterSpacing": "0.03em",
              "fontWeight": "700"
            },
            {
              "name": "2xl",
              "size": "2rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.03em",
              "fontWeight": "700"
            },
            {
              "name": "3xl",
              "size": "2.5rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.035em",
              "fontWeight": "700"
            },
            {
              "name": "4xl",
              "size": "3rem",
              "lineHeight": "1.1",
              "letterSpacing": "0.04em",
              "fontWeight": "800"
            },
            {
              "name": "5xl",
              "size": "3.75rem",
              "lineHeight": "1.1",
              "letterSpacing": "0.04em",
              "fontWeight": "800"
            },
            {
              "name": "6xl",
              "size": "4.5rem",
              "lineHeight": "1.05",
              "letterSpacing": "0.045em",
              "fontWeight": "900"
            },
            {
              "name": "7xl",
              "size": "5rem",
              "lineHeight": "1.05",
              "letterSpacing": "0.05em",
              "fontWeight": "900"
            },
            {
              "name": "8xl",
              "size": "6rem",
              "lineHeight": "1",
              "letterSpacing": "0.05em",
              "fontWeight": "900"
            },
            {
              "name": "9xl",
              "size": "8rem",
              "lineHeight": "1",
              "letterSpacing": "0.06em",
              "fontWeight": "900"
            }
          ]
        },
        "layout": {
          "layoutDna": {
            "densitySpectrum": "Balanced",
            "contrastSpectrum": "High-Contrast",
            "gridAlignmentSpectrum": "Modular",
            "negativeSpaceUsage": "Generous",
            "textVsImageEmphasis": "Balanced",
            "complexitySpectrum": "Simple & Clean"
          },
          "grid": {
            "compositionApproach": "Column-based with asymmetrical blocks",
            "spacing": {
              "columns": "12-column grid",
              "rows": "Implicit rows",
              "gaps": "Consistent medium gaps"
            },
            "margins": "Generous page margins",
            "padding": "Consistent padding within containers"
          }
        },
        "components": {
          "containers": "Containers use solid color backgrounds from the palette to create distinct sections, often spanning full width with generous padding. They maintain clean edges and clear separation between content blocks, supporting the modular grid layout. The use of 'primary', 'secondary', and 'background' colors in containers helps establish visual hierarchy and brand consistency.",
          "images": "Images are presented as large rectangular blocks aligned with text sections, often flush with container edges. They maintain natural aspect ratios and are integrated seamlessly into the grid, providing visual interest without overwhelming the layout. Images are framed by color blocks or white space to maintain balance.",
          "buttons": "Buttons are minimalistic with solid fills in 'secondary' burnt orange or outlined styles using 'secondary' color. Text on buttons uses 'secondaryForeground' white or 'secondary' color for outlines. Buttons have subtle hover effects and are sized to be easily clickable, maintaining the clean and modern aesthetic."
        },
        "graphicElements": {
          "icons": "Icons are minimal and monochromatic, typically using 'deepBlack' or 'secondary' colors. They are small and unobtrusive, supporting navigation and calls to action without distracting from main content.",
          "illustrations": "No prominent illustrations are used; the design relies on photography and color blocks for visual interest.",
          "stickers": "Small circular dots in 'highlightGreen' and 'accentOrange' serve as subtle graphic accents, used near text links or headings to add brand personality."
        }
      },
      "originImagesUrls": [
        "https://wixmp-fe53c9ff592a4da924211f23.wixmp.com/uploads/1752408313658-Screenshot%202025-06-05%20at%2010.28.30.jpg"
      ]
    }
  ],
  "brandBook": {
    "tones": [
      "Empowering",
      "Trustworthy",
      "Clear",
      "Professional",
      "Accessible",
      "Modern",
      "Premium"
    ],
    "designStyle": {
      "primaryStyle": [
        "Minimalist",
        "Modern",
        "Clean"
      ],
      "supportingStyles": [
        "Premium",
        "Tech-focused",
        "Trustworthy"
      ]
    },
    "toneOfVoice": "Empowering, Trustworthy, Clear, Professional, Accessible",
    "components": {
      "images": "Layout Role: Integrated cleanly within the grid, often full-width within a section or as a prominent element in a card. | Gallery Type: Clean Card-Based Grid: A uniform grid of cards, each containing an image, title, and brief description. Images are consistently sized within their cards.",
      "buttons": "Primary: background-color: #007AFF, color: #FFFFFF, border-radius: 8px, padding: 12px 24px, font-weight: 600. Secondary: background-color: transparent, color: #007AFF, border: 1px solid #007AFF, border-radius: 8px, padding: 12px 24px, font-weight: 600. Hover states should subtly change background opacity or add a slight scale effect.",
      "containers": "Method: Whitespace, Style: 80px vertical margin between sections. Internal containers use 24px-32px padding. No borders or shadows unless for specific interactive states."
    },
    "typography": {
      "headings": {
        "font": {
          "role": "headings",
          "fontFamily": "rubik-v2",
          "fontJustification": ""
        },
        "headingsUsageGuide": "Headings should be bold and use a clear hierarchy. Use 'rubik-v2' for all headings. Employ variations in font size and weight (e.g., Bold for H1/H2, Medium for H3/H4) to establish a clear visual hierarchy. Ensure ample line height for readability.",
        "headingsSimilarFonts": [],
        "headingsAccessibilityNotes": "Ensure sufficient contrast between heading text and background. Avoid excessively small font sizes for headings, especially on mobile. Maintain consistent weight and size for similar heading levels."
      },
      "fontSizes": [
        {
          "name": "xs",
          "size": "0.75rem",
          "letterSpacing": "0.02em",
          "lineHeight": "1.25",
          "fontWeight": "400"
        },
        {
          "name": "sm",
          "size": "0.875rem",
          "letterSpacing": "0.02em",
          "lineHeight": "1.3",
          "fontWeight": "400"
        },
        {
          "name": "base",
          "size": "1rem",
          "letterSpacing": "0.01em",
          "lineHeight": "1.5",
          "fontWeight": "400"
        },
        {
          "name": "lg",
          "size": "1.125rem",
          "letterSpacing": "0.01em",
          "lineHeight": "1.5",
          "fontWeight": "500"
        },
        {
          "name": "xl",
          "size": "1.25rem",
          "letterSpacing": "0.01em",
          "lineHeight": "1.4",
          "fontWeight": "600"
        },
        {
          "name": "2xl",
          "size": "1.5rem",
          "letterSpacing": "0.01em",
          "lineHeight": "1.3",
          "fontWeight": "600"
        },
        {
          "name": "3xl",
          "size": "1.875rem",
          "letterSpacing": "0.005em",
          "lineHeight": "1.2",
          "fontWeight": "700"
        },
        {
          "name": "4xl",
          "size": "2.25rem",
          "letterSpacing": "0.005em",
          "lineHeight": "1.15",
          "fontWeight": "700"
        },
        {
          "name": "5xl",
          "size": "3rem",
          "letterSpacing": "0.002em",
          "lineHeight": "1.1",
          "fontWeight": "700"
        },
        {
          "name": "6xl",
          "size": "3.75rem",
          "letterSpacing": "0.001em",
          "lineHeight": "1.05",
          "fontWeight": "700"
        },
        {
          "name": "7xl",
          "size": "4.5rem",
          "letterSpacing": "0",
          "lineHeight": "1.02",
          "fontWeight": "700"
        },
        {
          "name": "8xl",
          "size": "6rem",
          "letterSpacing": "0",
          "lineHeight": "1",
          "fontWeight": "700"
        },
        {
          "name": "9xl",
          "size": "8rem",
          "letterSpacing": "0",
          "lineHeight": "1",
          "fontWeight": "700"
        }
      ],
      "paragraphs": {
        "font": {
          "role": "paragraphs",
          "fontFamily": "open sans",
          "fontJustification": ""
        },
        "paragraphsUsageGuide": "Body text should be highly readable, using 'open sans' in a regular or medium weight. Maintain a comfortable line height and adequate letter spacing for extended reading. Ensure text is not too narrow or too wide.",
        "paragraphsSimilarFonts": [],
        "paragraphsAccessibilityNotes": "Paragraph text must have a minimum font size of 16px (or equivalent rem) for desktop and 14px for mobile. Maintain a minimum contrast ratio of 4.5:1 for body text against its background. Avoid justified text, which can create uneven spacing and readability issues."
      },
      "welcomeSectionTypography": {
        "placement": "Centered within the hero section, or left-aligned with ample space.",
        "implementation": "Headline: Use 'rubik-v2' Bold, large size (e.g., 5xl-7xl). Tagline: Use 'open sans' Regular or Medium, smaller size (e.g., xl-2xl), potentially with slightly increased letter spacing for elegance."
      }
    },
    "originImagesUrls": [],
    "layout": {
      "grid": {
        "margins": "Generous margins around content blocks and sections to enhance negative space.",
        "padding": "Consistent internal padding within containers and grid cells, typically 24px or 32px.",
        "spacing": {
          "gaps": "Base unit: 8px. All grid gaps and internal spacing are multiples of 8px (e.g., 16px, 24px, 32px).",
          "rows": "Flexible, determined by content and section height",
          "columns": "12 columns"
        },
        "compositionApproach": "Strict 12-column grid with full-bleed sections and generous internal padding."
      },
      "layoutDna": {
        "contrastSpectrum": "High contrast between text and background, with accent colors used strategically for emphasis.",
        "densitySpectrum": "Spacious and airy, with significant negative space defining content blocks.",
        "textVsImageEmphasis": "Balanced, with clear typography as the primary information carrier, supported by clean imagery and icons.",
        "complexitySpectrum": "Minimalist and functional, avoiding decorative elements or visual clutter.",
        "gridAlignmentSpectrum": "Strict adherence to a 12-column grid for perfect alignment and balance.",
        "negativeSpaceUsage": "Extensive and disciplined use of whitespace to create clarity, focus, and a premium feel."
      },
      "heroSectionLayout": "**The Clarity Canvas**\nComposition (Tailwind Spec): `relative h-screen w-full flex items-center justify-center overflow-hidden`.\nSignature Hook (Framer Motion Spec): `motion.div` with `initial={{ opacity: 0 }}` and `animate={{ opacity: 1 }}` with `transition={{ duration: 1.5 }}`. Headline `motion.h1` uses `variants` with `transition: { staggerChildren: 0.05 }`. Each letter `span` has `initial={{ opacity: 0, y: 20 }}` and `animate={{ opacity: 1, y: 0 }}`. Tagline `motion.p` fades in after headline."
    },
    "graphicElements": {
      "icons": "Style: Clean, line-based icons with a consistent stroke weight. Use accent blue or dark grey. Ensure they are scalable and maintain clarity at various sizes.",
      "stickers": "",
      "illustrations": "Style: Minimalist, flat illustrations using the brand palette (blue, purple, white, grey). Focus on conveying concepts rather than decorative detail."
    },
    "designSummary": "**The Opportunity Canvas: Minimalist Clarity with Strategic Accents**\n\nThe OppSphere brand identity is built upon the principle of 'Minimalist Clarity,' drawing inspiration from the disciplined elegance of Japanese Zen gardens and the functional purity of Dieter Rams' design philosophy. Our approach is to create a transparent, highly functional digital space that serves as a perfect canvas for the diverse opportunities we present. The design will be characterized by an extreme, disciplined use of negative space, a strict adherence to a multi-column grid for perfect alignment, and a refined typographic hierarchy. While the core aesthetic is clean and monochromatic, strategic use of a sophisticated blue and soft purple palette will introduce a modern, trustworthy, and premium feel, guiding the user's eye to critical actions and information without overwhelming the minimalist foundation. Animations will be subtle and functional, enhancing the user experience rather than distracting from it. This synthesis ensures OppSphere feels both cutting-edge and profoundly accessible.\n\n**Execution Blueprint:**\n1. **The Grid as Foundation:** A strict 12-column grid will govern all layouts, ensuring perfect alignment and balance. Content will be structured within this grid, with generous padding to maximize negative space.\n2. **Typography as the Primary Voice:** A single, highly legible Sans-Serif font will be used. Hierarchy will be achieved through precise variations in size, weight, and case, ensuring readability and a premium feel.\n3. **Color Restraint:** A base of white and light grey will dominate. A primary blue and a secondary soft purple will be used sparingly for CTAs, links, and key interactive elements, reinforcing trust and modernity.\n4. **Whitespace as a Design Element:** Generous use of negative space will define sections and create visual breathing room, making content easily digestible and highlighting the 'premium' aspect.\n5. **Functional Animation:** Animations will be subtle, focusing on smooth transitions for state changes (e.g., hover effects, modal openings) and gentle reveals, enhancing usability without compromising the minimalist aesthetic.\n6. **Iconography for Clarity:** Simple, line-based icons will be used for categories and key features, providing immediate visual cues without adding decorative clutter.",
    "palette": {
      "colors": {
        "background": "#F8F9FA",
        "secondary": "#8A2BE2",
        "customColors": [
          {
            "name": "accentBlue",
            "value": "#007AFF"
          },
          {
            "name": "accentPurple",
            "value": "#8A2BE2"
          },
          {
            "name": "neutralGrey",
            "value": "#CCCCCC"
          },
          {
            "name": "darkGrey",
            "value": "#333333"
          },
          {
            "name": "offWhite",
            "value": "#F8F9FA"
          }
        ],
        "foreground": "#333333",
        "secondaryForeground": "#FFFFFF",
        "primaryForeground": "#FFFFFF",
        "primary": "#007AFF"
      },
      "paletteUsageGuide": "The primary palette consists of a clean off-white background (#F8F9FA) and dark grey foreground (#333333) for maximum readability. The primary accent color is a vibrant blue (#007AFF), used for primary calls-to-action, links, and interactive elements. A secondary soft purple (#8A2BE2) is used for supporting elements or to create visual distinction in specific sections. Neutral grey (#CCCCCC) can be used for borders, dividers, or secondary text. Ensure high contrast for all text elements against their backgrounds.",
      "paletteAccessibilityNotes": "All color combinations must meet WCAG AA contrast ratios. The primary blue and secondary purple are chosen for their accessibility against white and off-white backgrounds. Text on colored backgrounds must also meet contrast requirements. Avoid using purple for critical information if it significantly reduces contrast with the background or primary text."
    }
  },
  "initialPrompt": "Build a clean, modern, mobile-responsive website for my startup OppSphere.\n\nBrand Name: OppSphere\nTagline: A World Built on Opportunities.\n\nAbout the Company:\nOppSphere is a global platform built to bring internships, competitions, jobs, workshops, and learning opportunities into one ecosystem. It helps students, freshers, and professionals discover the right chances and grow their careers.\n\nBrand Story:\nOppSphere started with a simple idea  to create a world where opportunities are accessible to everyone. Students and young professionals often struggle to find verified internships and career-building chances in one place. OppSphere was born to solve this. With the vision of building A World Built on Opportunities, the platform aims to empower every learner with the right path to grow.\n\nMission:\nTo deliver verified, meaningful, and growth-focused opportunities on one platform and help individuals grow their skills, careers, and confidence.\n\nVision:\nTo build the worlds largest ecosystem of opportunities  a place recognized globally as The Opportunity World, where everyone can find the right chance regardless of their background or skill level.\n\nWebsite Structure (Generate these pages):\n1. Home Page\n Hero section with brand name, tagline\n Quick categories (Internships, Jobs, Competitions, Courses, Workshops, Blogs)\n Why OppSphere?\n Featured Opportunities\n User Testimonials\n Call to Action (Join Community / Explore Opportunities)\n2. About Us\n Brand Story\n Mission\n Vision\n What makes OppSphere unique\n Team (placeholder section)\n3. Opportunities Page\n Filters: Category, Remote/Offline, Paid/Unpaid, Skill Level\n Separate pages for Internships, Jobs, Competitions, Workshops\n4. Blogs / Articles Page\n SEO-friendly article structure\n Career tips, learning guides, opportunity updates\n5. Contact Page\n Email, Social Media, Contact Form\n6. Join As Partner / Post Opportunity\n Form for companies to submit opportunities\n Why partner with OppSphere?\n7. Privacy Policy & Terms\n\nDesign Requirements:\n Minimal, modern, premium UI\n Colors (suggested): Blue + White + Soft Purple (tech + trust theme)\n Smooth animations\n Icons for categories\n Clean typography (bold headings + readable body text)",
  "status": "READY",
  "revision": "10",
  "createdDate": "2026-01-20T13:12:51.831Z",
  "updatedDate": "2026-01-20T13:13:25.638Z",
  "attachments": {
    "contentImagesUrls": [],
    "inspirationImagesUrls": []
  },
  "selectedBrandingPresetId": "00000000-af5e-4330-86f0-53adbcd2adc9",
  "plan": "\n\n```json\n{\n  \"sections\": [\n    {\n      \"id\": \"overview\",\n      \"title\": \"## Overview\",\n      \"content\": \"This plan creates a modern, mobile-responsive website for OppSphere, a global platform that aggregates internships, competitions, jobs, workshops, and learning opportunities. The site will showcase the brand story, display categorized opportunities with filtering capabilities, feature blog articles, and provide contact and partnership forms.\"\n    },\n    {\n      \"id\": \"key-features\",\n      \"title\": \"## Key features\",\n      \"content\": \"- **View Opportunity Listing**: Browse all available opportunities (internships, jobs, competitions, workshops) in a unified view.\\n- **Filter Opportunities**: Refine opportunities by category, location type (remote/offline), compensation (paid/unpaid), and skill level.\\n- **View Opportunity Details**: See complete information about a specific opportunity.\\n- **View Blog Listing**: Browse all published articles covering career tips, learning guides, and opportunity updates.\\n- **View Blog Details**: Read the full content of a selected blog article.\\n- **Submit Partnership Form**: Allow companies to submit opportunities and express interest in partnering with OppSphere.\\n- **Submit Contact Form**: Enable visitors to send inquiries or messages to OppSphere.\\n- **View About Information**: Learn about OppSphere's brand story, mission, vision, and unique value proposition.\\n- **View Privacy Policy**: Access the site's privacy policy and terms of service.\",\n      \"metadata\": [\n        { \"id\": \"view-opportunity-listing\", \"name\": \"View Opportunity Listing\" },\n        { \"id\": \"filter-opportunities\", \"name\": \"Filter Opportunities\" },\n        { \"id\": \"view-opportunity-details\", \"name\": \"View Opportunity Details\" },\n        { \"id\": \"view-blog-listing\", \"name\": \"View Blog Listing\" },\n        { \"id\": \"view-blog-details\", \"name\": \"View Blog Details\" },\n        { \"id\": \"submit-partnership-form\", \"name\": \"Submit Partnership Form\" },\n        { \"id\": \"submit-contact-form\", \"name\": \"Submit Contact Form\" },\n        { \"id\": \"view-about-information\", \"name\": \"View About Information\" },\n        { \"id\": \"view-privacy-policy\", \"name\": \"View Privacy Policy\" }\n      ]\n    },\n    {\n      \"id\": \"structure\",\n      \"title\": \"## Structure\",\n      \"content\": \"- **Header (Reusable)**: Contains the OppSphere brand name, navigation menu with links to all main pages, and a call-to-action button.\\n- **Footer (Reusable)**: Displays social media links, quick navigation links, contact information, and links to Privacy Policy and Terms.\\n- **Home Page**: Features a hero section with brand name and tagline, quick category navigation (Internships, Jobs, Competitions, Courses, Workshops, Blogs), Why OppSphere section, featured opportunities showcase, user testimonials, and a call-to-action to join the community or explore opportunities.\\n- **About Us Page**: Presents the brand story, mission, vision, what makes OppSphere unique, and a placeholder team section.\\n- **Opportunities Page**: Displays the opportunity listing with filtering options (category, remote/offline, paid/unpaid, skill level) and shows opportunity details in a modal or detail view.\\n- **Internships Page**: Shows opportunities filtered specifically for internships category.\\n- **Jobs Page**: Shows opportunities filtered specifically for jobs category.\\n- **Competitions Page**: Shows opportunities filtered specifically for competitions category.\\n- **Workshops Page**: Shows opportunities filtered specifically for workshops category.\\n- **Blogs Page**: Displays the blog listing and allows viewing individual blog article details.\\n- **Contact Page**: Provides email, social media links, and a contact form for visitor inquiries.\\n- **Partner Page**: Features information on why companies should partner with OppSphere and includes a form for submitting opportunities.\\n- **Privacy Policy Page**: Contains the privacy policy and terms of service content.\"\n    }\n  ],\n  \"apps\": [\n    {\n      \"id\": \"wix-cms\",\n      \"keyFeatures\": [\n        { \"id\": \"view-opportunity-listing\", \"name\": \"View Opportunity Listing\" },\n        { \"id\": \"filter-opportunities\", \"name\": \"Filter Opportunities\" },\n        { \"id\": \"view-opportunity-details\", \"name\": \"View Opportunity Details\" },\n        { \"id\": \"view-blog-listing\", \"name\": \"View Blog Listing\" },\n        { \"id\": \"view-blog-details\", \"name\": \"View Blog Details\" },\n        { \"id\": \"submit-partnership-form\", \"name\": \"Submit Partnership Form\" },\n        { \"id\": \"submit-contact-form\", \"name\": \"Submit Contact Form\" },\n        { \"id\": \"view-about-information\", \"name\": \"View About Information\" },\n        { \"id\": \"view-privacy-policy\", \"name\": \"View Privacy Policy\" }\n      ]\n    }\n  ],\n  \"version\": \"4.0.0\"\n}\n```",
  "designerData": {
    "designerId": "643efd59-4335-4582-a3a6-9a56a8750a37",
    "designerName": "Isla",
    "selectionMethod": "UNSELECTED"
  }
}